Repository: Wesley-Li/eshop
Catalog: mezzanine/core/locale/*/LC_MESSAGES/django.po
Languages: vi_vn

source: This field is required if status is set to published.
vi_vn: Bắt buộc nếu Trạng thại được chọn là Xuất bản

source: Controls the ordering and grouping of the admin menu.
vi_vn: Điều khiển thứ tự và phân nhóm của menu quản trị

source: Content
vi_vn: Nội dung

source: Media Library
vi_vn: Thư viện Media

source: Users
vi_vn: Người dùng

source: Unregister these models from the admin.
vi_vn: Gỡ bỏ model này khỏi quản trị

source: Size of thumbnail previews for image fields in the admin interface.
vi_vn: Kích thước tảnh humbnail cho các trường image trong giao diện quản trị

source: Key for http://akismet.com spam filtering service. Used for filtering comments and forms.
vi_vn: Key của dịch vụ chặn spam http://akismet.com . Dùng để lọc các nhận xét có spam.

source: Access token for http://bit.ly URL shortening service.
vi_vn: Token key cho http://bit.ly

source: Mezzanine's caching uses a technique know as mint caching. This is where the requested expiry for a cache entry is stored with the cache entry in cache, and the real expiry used has the ``CACHE_SET_DELAY`` added to it. Then on a cache get, the store expiry is checked, and if it has past, the cache entry is set again, and no entry is returned. This tries to ensure that cache misses never occur, and if many clients were to get a cache miss at once, only one would actually need to re-generated the cache entry.
vi_vn: Cache của Mezzanine sử dụng một kĩ thuật gọi là mint caching.

source: A three item sequence, each containing a sequence of template tags used to render the admin dashboard.
vi_vn: Danh sách gồm 3 thành phần, mỗi phần chứa 1 danh sách các thẻ template dùng để hiển thị bảng điều khiển quản trị

source: Device specific template sub-directory to use as the default device.
vi_vn: Thư mục template tương ứng cho thiết bị truy cập (máy tính, điện thoại, máy tính bảng) được chọn làm mặc định

source: If ``True``, website forms will use HTML5 features.
vi_vn: Nếu ``True``, form của website sẽ dùng tính năng HTML5.

source: A sequence of fields that will be injected into Mezzanine's (or any library's) models. Each item in the sequence is a four item sequence. The first two items are the dotted path to the model and its field name to be added, and the dotted path to the field class to use for the field. The third and fourth items are a sequence of positional args and a dictionary of keyword args, to use when creating the field instance. When specifying the field class, the path ``django.models.db.`` can be omitted for regular Django model fields.
vi_vn: Danh sách các trường được chèn vào model của Mezzanine (hoặc bất kỳ thư viện). Mỗi thành phần trong danh sách gồm 1 chuỗi 4 thành phần theo thứ tự: Đường dẫn đến model và tên trường muốn thêm vào; Đường dẫn đến Class trường; Danh sách các đối số theo tứ tự ; Từ điển các đối số kí tự để dùng khi tạo trường. Khi khai báo Class, có thể bỏ qua khai báo ``django.models.db.`` nếu dùng các trường của Django

source: Name of the jQuery file.
vi_vn: Tên file jQuery

source: Name of the jQuery file found in mezzanine/core/static/mezzanine/js/
vi_vn: Tên file jQuery tìm thấy trong mezzanine/core/static/mezzanine/js/

source: Name of the jQuery UI file.
vi_vn: Tên của file jQuery UI

source: Name of the jQuery UI file found in mezzanine/core/static/mezzanine/js/
vi_vn: Tên của file jQuery UI tìm thấy trong mezzanine/core/static/mezzanine/js/

source: Max paging links
vi_vn: Liên kết trang tối đa

source: Max number of paging links to display when paginating.
vi_vn: Số liên kết trang tối đa hiển thị khi phân trang

source: Media library per site
vi_vn: Thư viện Media cho mỗi site

source: If ``True``, each site will use its own directory within the filebrowser media library.
vi_vn: Nếu ``True``, mỗi site sẽ dùng thư mục riêng trong thư viện media filebrowser

source: Dotted package path and class name of the widget to use for the ``RichTextField``.
vi_vn: Đường dẫn và tên của widget dùng cho ``RichTextField``.

source: List of HTML tags that won't be stripped from ``RichTextField`` instances.
vi_vn: Danh sách các thẻ HTML không bị loại bỏ khỏi ``RichTextField``

source: List of HTML attributes that won't be stripped from ``RichTextField`` instances.
vi_vn: Danh sách các thuộc tính HTML không bị lọc bỏ khỏi ``RichTextField``

source: List of inline CSS styles that won't be stripped from ``RichTextField`` instances.
vi_vn: Danh sách các CSS style không bị lọc bỏ khỏi ``RichTextField``

source: Dotted path to the function to call on a ``RichTextField`` value before it is rendered to the template.
vi_vn: Đường dẫn tới hàm gọi giá trị ``RichTextField`` trước khi được hiển thị vào template

source: High
vi_vn: Cao

source: Low (allows video, iframe, Flash, etc)
vi_vn: Thấp (cho phép video, iframe, Flash, v.v..)

source: No filtering
vi_vn: Không lọc

source: Rich Text filter level
vi_vn: Mức độ lọc Rich Text

source: *Do not change this setting unless you know what you're doing.* When content is saved in a Rich Text (WYSIWYG) field, unsafe HTML tags and attributes are stripped from the content to protect against staff members intentionally adding code that could be used to cause problems, such as changing their account to a super-user with full access to the system. This setting allows you to change the level of filtering that occurs. Setting it to low will allow certain extra tags to be permitted, such as those required for embedding video. While these tags are not the main candidates for users adding malicious code, they are still considered dangerous and could potentially be mis-used by a particularly technical user, and so are filtered out when the filtering level is set to high. Setting the filtering level to no filtering, will disable all filtering, and allow any code to be entered by staff members, including script tags.
vi_vn: *Không thay đổi thiết lập này trừ khi bạn biết mình đang làm gì.* Khi nội dung được lưu trong trường Rich Text (WYSIWYG), các thẻ HTML không an toàn và thuộc tính được lược bỏ khỏi nội dung để tránh việc người dùng trong hệ thống cố tình đưa các đoạn mã gây hại vào chẳng hạn như thay đổi tài khoản của người dùng thành quản trị để toàn quyền truy xuất vào hệ thống. Thiết lập này cho phép bạn thay đổi cấp độ lọc. Điều này cho phép các thẻ mở rộng được phép sử dụng, ví dụ thẻ để nhúng video, mp3. Mặc dùng những thẻ này không thuộc nhóm các thẻ để người dùng thêm các đoạn mã gây gạy, chúng vẫn được coi là nguy hiểm và có thể gây ra các lỗi kĩ thuật khác, vì vậy chúng được sẽ bị lọc bỏ khi cấp độ lọc được thiết lập ở mức cao nhất. Thiết lập cấp độ lọc thành không lọc sẽ tắt chế độ lọc và cho phép người dùng thêm vào các đoạn mã bất kì, bao gồm cả các thẻ script

source: Sequence of models that will be provided by default as choices in the search form. Each model should be in the format ``app_label.model_name``. Only models that subclass ``mezzanine.core.models.Displayable`` should be used.
vi_vn: Danh sách các model trong form tìm kiếm. Mỗi model nên theo định dạng ``app_label.model_name``. Chỉ `nên dùng model kế thừa từ `mezzanine.core.models.Displayable`

source: Search results per page
vi_vn: Kết quả tìm kiếm từng trang

source: Number of results shown in the search results page.
vi_vn: Kết quả hiện thị trong trang kết quả tìm kiếm

source: A URL prefix for mounting all of Mezzanine's urlpatterns under. When using this, you'll also need to manually apply it to your project's root ``urls.py`` module. The root ``urls.py`` module provided by Mezzanine's ``mezzanine-project`` command contains an example of this towards its end.
vi_vn: Một tiền tố URL dùng để gọi các urlpatterns của Mezzanine. Khi dùng tính năng này, bạn sẽ phải khai báo vào trong module ``urls.py`` nằm trong thư mục gốc của dự án. Module gốc ``urls.py`` tạo bởi lệnh ``mezzanine-project`` chứa sẵn các ví dụ để bạn tham khảo

source: Site Title
vi_vn: Tiêu đề Site

source: Title that will display at the top of the site, and be appended to the content of the HTML title tags on every page.
vi_vn: Tiêu đề hiển thị ở phần đầu của site và được gán thêm vào nội dung của các thẻ HTML title trong mỗi trang

source: A tag line that will appear at the top of all pages.
vi_vn: Một dòng các thẻ sẽ hiển thị tại phần đầu của các trang

source: An open source content management platform.
vi_vn: Một hệ thống quản trị nội dung mã nguồn mở

source: Dotted Python path to the callable for converting strings into URL slugs. Defaults to ``mezzanine.utils.urls.slugify_unicode`` which allows for non-ascii URLS. Change to ``django.template.defaultfilters.slugify`` to use Django's slugify function, or something of your own if required.
vi_vn: Thiết lập chế độ Unicode cho URL Slug. Mặc định là ``mezzanine.utils.urls.slugify_unicode``, cho phép các kí tự không thuộc URL ascii. Chuyển thành ``django.template.defaultfilters.slugify`` để dùng hàm slugify của Django hoặc hàm do bạn tự viết

source: Sequence of dotted Python paths to callable functions used for checking posted content (such as forms or comments) is spam. Each function should accept three arguments: the request object, the form object, and the URL that was posted from. Defaults to ``mezzanine.utils.views.is_spam_akismet`` which will use the http://akismet.com spam filtering service when the ``AKISMET_API_KEY`` setting is configured.
vi_vn: Danh sách đường dẫn Python đến các hàm để kiểm tra spam cho nội dung được gửi. Mỗi hàm nên gồm 3 tham số: request object, form object và URL được gửi đến. Mặc định, ``mezzanine.utils.views.is_spam_akismet`` sẽ dùng dịch vụ lọc spam của http://akismet.com khi ``AKISMET_API_KEY`` được khai báo.

source: Enable SSL
vi_vn: Bật SSL

source: If ``True``, users will be automatically redirected to HTTPS for the URLs specified by the ``SSL_FORCE_URL_PREFIXES`` setting.
vi_vn: Nếu ``True``, người dùng sẽ tự động được chuyển sang HTTPS đối với URLS khai báo trong ``SSL_FORCE_URL_PREFIXES``

source: Host name that the site should always be accessed via that matches the SSL certificate.
vi_vn: Tên host truy xuất tới site khớp với chứng chỉ SSL

source: If ``True``, only URLs specified by the ``SSL_FORCE_URL_PREFIXES`` setting will be accessible over SSL, and all other URLs will be redirected back to HTTP if accessed over HTTPS.
vi_vn: Nếu ``True``, chỉ các URL khai báo trong thiết lập ``SSL_FORCE_URL_PREFIXES``sẽ truy xuất qua SSL và tất các các URL khác sẽ được chuyển hướng ngược sang HTTP nếu truy xuất qua HTTPS

source: List of words which will be stripped from search queries.
vi_vn: Danh sách các từ sẽ bị lọc bỏ khỏi chuỗi tìm kiếm

source: Tag Cloud Sizes
vi_vn: Kích thước Tag Cloud

source: Number of different sizes for tags when shown as a cloud.
vi_vn: Kích thước cho tags khi hiển thị thành cloud

source: Sequence of setting names available within templates.
vi_vn: Danh sách các tên thiết lập trong template

source: Directory name to store thumbnails in, that will be created relative to the original image's directory.
vi_vn: Tên thư mục lưu thumbnails (Sẽ được tạo dựa trên thư mục của ảnh gốc)

source: URL for the JavaScript file (relative to ``STATIC_URL``) that handles configuring TinyMCE when the default ``RICHTEXT_WIDGET_CLASS`` is used.
vi_vn: URL cho file javascript (đường dẫn tương đối với ``STATIC_URL``) mà xử lý thiết lập TinyMCE khi ``RICHTEXT_WIDGET_CLASS` được dùng

source: Dict mapping file field names in the format ``app_label.model_name.field_name`` to the Python dotted path to function names that will be used for the file field's ``upload_to`` argument.
vi_vn: Từ điển tên trường file theo định dạng ``app_label.model_name.field_name`` dùng cho đối số ``upload_to``

source: If ``True``, the south application will be automatically added to the ``INSTALLED_APPS`` setting.
vi_vn: Nếu ``True``, ứng dụng south sẽ được tự động thêm vào thiết lập ``INSTALLED_APPS``

source: Could not import the value of settings.RICHTEXT_WIDGET_CLASS: %s
vi_vn: Không thể đọc giá trị của settings.RICHTEXT_WIDGET_CLASS: %s

source: Order
vi_vn: Thứ tự

source: Title
vi_vn: Tiêu đề

source: Leave blank to have the URL auto-generated from the title.
vi_vn: Để trống để tự động tạo URL từ tiêu đề

source: View on site
vi_vn: Xem trên site

source: Optional title to be used in the HTML title tag. If left blank, the main title field will be used.
vi_vn: Tiêu đề tùy chọn dùng trong thẻ HTML title. Nếu để trống, trường title chính sẽ được dùng

source: Description
vi_vn: Mô tả

source: Generate description
vi_vn: Tạo mô tả

source: If checked, the description will be automatically generated from content. Uncheck if you want to manually set a custom description.
vi_vn: Nếu chọn, phần mô tả sẽ được tự động tạo ra từ phần Nội dung. Bỏ chọn nếu bạn muốn tự viết mô tả

source: Keywords
vi_vn: Từ khóa

source: Draft
vi_vn: Bản nháp

source: Published
vi_vn: Xuất bản

source: Status
vi_vn: Trạng thái

source: With Draft chosen, will only be shown for admin users on the site.
vi_vn: Nếu chọn Bản nháp, chỉ có quản trị mới xem được trên site

source: Published from
vi_vn: Xuất bản từ

source: With Published chosen, won't be shown until this time
vi_vn: Nếu chọn Xuất bản, nội dung sẽ không được hiển thị cho đến thời gian này

source: Expires on
vi_vn: Hết hạn vào

source: With Published chosen, won't be shown after this time
vi_vn: Nếu chọn Xuất bản, nội dung sẽ không hiển thị sau thời gian này

source: Show in sitemap
vi_vn: Hiển thị trong sitemap

source: Author
vi_vn: Tác giả

source: Site permission
vi_vn: Quyền hạn Site

source: Site permissions
vi_vn: Quyền hạn Site

source: Permission denied
vi_vn: Không có quyền

source: Everything
vi_vn: Mọi thứ

source: and
vi_vn: và

source: Theme by
vi_vn: Theme bởi

source: View Mobile Site
vi_vn: Xem trên di động

source: Home
vi_vn: Trang nhà

source: <h2>Congratulations!</h2> <p> Welcome to your new Mezzanine powered website. Here are some quick links to get you started: </p> <ul> <li><a href="/admin/">Log in to the admin interface</a></li> <li><a href="http://mezzanine.jupo.org/docs/content-architecture.html">Creating custom page types</a></li> <li><a href="http://mezzanine.jupo.org/docs/frequently-asked-questions.html#templates">Modifying HTML templates</a></li> <li><a href="http://mezzanine.jupo.org/docs/frequently-asked-questions.html#why-isn-t-the-homepage-a-page-object-i-can-edit-via-the-admin">Changing this homepage</a></li> <li><a href="http://mezzanine.jupo.org/docs/frequently-asked-questions.html">Other frequently asked questions</a></li> <li><a href="http://mezzanine.jupo.org/docs/configuration.html#default-settings">Full list of settings</a></li> <li><a href="http://mezzanine.jupo.org/docs/deployment.html">Deploying to a production server</a></li> </ul>
vi_vn: <h2>Chúc mừng!</h2> <p> Chào mừng bạn đến với website được phát triển trên nền Mezzanine Dưới đây là một số liên kết nhanh bạn có thể bắt đầu: </p> <ul> <li><a href="/admin/">Đăng nhập vào trang quản trị</a></li> <li><a href="http://mezzanine.jupo.org/docs/content-architecture.html">Tạo các trang tùy biến </a></li> <li><a href="http://mezzanine.jupo.org/docs/frequently-asked-questions.html#templates">Sửa đổi template HTML</a></li> <li><a href="http://mezzanine.jupo.org/docs/frequently-asked-questions.html#why-isn-t-the-homepage-a-page-object-i-can-edit-via-the-admin">Thay đổi trang chủ</a></li> <li><a href="http://mezzanine.jupo.org/docs/frequently-asked-questions.html">Các câu hỏi thường gặp</a></li> <li><a href="http://mezzanine.jupo.org/docs/configuration.html#default-settings">Full list of settings</a></li> <li><a href="http://mezzanine.jupo.org/docs/deployment.html">Triển khai lên server</a></li> </ul>

source: Search Results
vi_vn: Kết quả tìm kiếm

source: No results were found in %(search_type)s matching your query: %(query)s
vi_vn: Không tìm thấy trong %(search_type)s khớp với truy vấn của bạn: %(query)s

source: Showing %(start)s to %(end)s of %(total)s results in %(search_type)s matching your query: %(query)s
vi_vn: Hiển thị %(start)s đến %(end)s của %(total)s kết quả trong %(search_type)s khớp với truy vấn: %(query)s

source: read more
vi_vn: đọc thêm

source: View site
vi_vn: Xem site

source: Dashboard
vi_vn: Bảng điều khiển

source: You don't have permission to access the admin for this site.
vi_vn: Bạn không có quyền truy cập trang quản trị site này

source: Password:
vi_vn: Mật khẩu:

source: Interface:
vi_vn: Giao diện:

source: Admin
vi_vn: Quản trị

source: Log in
vi_vn: Đăng nhập

source: Forgot password?
vi_vn: Quên mật khẩu?

source: Add
vi_vn: Thêm

source: Change
vi_vn: Thay đổi

source: Add another
vi_vn: Thêm

source: Recent Actions
vi_vn: Hoạt động gần đây

source: My Actions
vi_vn: Hoạt động của tôi

source: None available
vi_vn: Không tồn tại

source: Page not found
vi_vn: Không tìm thấy

source: The page you requested does not exist.
vi_vn: Trang bạn yêu cầu không tồn tại

source: Error
vi_vn: Lỗi

source: Sorry, an error occurred.
vi_vn: Có lỗi xảy ra

source: Save
vi_vn: Lưu

source: Cancel
vi_vn: Hủy

source: Edit
vi_vn: Chỉnh sửa

source: Log out
vi_vn: Thoát

source: of
vi_vn: của

source: Search
vi_vn: TÌm kiếm

source: Go
vi_vn: Đi
